{
  "app": {
    "heading": {
      "home": "Főoldal",
      "about": "Web",
      "cv": "CV"
    },
    "copied": "Vágólapra másolva!",
    "home": {
      "name": "A nevem ",
      "agePrefix": "",
      "ageSuffix": " éves vagyok.",
      "profession": "Szoftverfejlesztőként dolgozom már ",
      "specialty": " éve, főként full-stack webfejlesztéssel foglalkozom, kiemelt figyelmet fordítva a háttérben levő logikára. A backend oldalon főként java-val és Spring Boot-al foglalkozom, míg a frontend oldalon Angular-el dolgozok.",
      "site": "Az interneten sokféle weboldal design-al találkoztam, és mindig meglepett, hogy mennyire bonyolultak, nehezen mennek, furcsa kinézettel. Volt egy kis szabadidőm, és úgy döntöttem, hogy készítek magamnak egy egyszerű interaktív profilt, ami egyszerű mégis elég sok stílus van benne, miközben nem használja túl az erőforrásokat.",
      "opinions": "Egy webhelynek megfelelő kontraszttal, könnyen olvasható szöveggel, tiszta és egyszerű elrendezéssel kell rendelkeznie. Az animációknak sima átmenetekkel kell működniük. Ha egyszerű, egylapos alkalmazásként megírható, akkor úgy kell megírni. A statikus fájlok mérete nem haladhatja meg az 1 MB-ot, és minden teszten legalább megfelelő eredményt kell elérnie."
    },
    "posts": {
      "title": "Posztok",
      "manifesto": {
        "title": "Manifesto",
        "description": "Az utóbbi években a tech blogokkal való content farming láthatóan megnőtt, ami alacsonyabb minőségű információt eredményezett, sok esetben a kódrészlet nem is működik, a szöveg egyértelműen MI által íródott. Továbbá, a tartalom nagy része más forrásokból van másolva, bármiféle hivatkozás nélkül. Ebben a blogban személyesen garantálom, hogy olyan dolgokat teszek közzé, amiket kipróbáltam és implementáltam prototípusokban vagy élesben valamikor, ahol nekem működtek, ezek a saját munkám és kutatásom eredményei, kihagyva azokat a részleteket, amelyek nem tartoznak a téma körébe vagy projekt-specifikus információk, miközben a lehető legközelebb hozom egy működő példához. Bár minden tőlem telhetőt megteszek, nem tudom garantálni, hogy frissíteni tudom és működőképes állapotban tudom tartani az információkat. Ha támogatni szeretnéd a munkámat, kérlek oszd meg és hivatkozz a bejegyzésre, amit hasznosnak találtál, a bejegyzésemre mutató linkkel és a nevemmel (Jakab Szilárd)."
      },
      "motivation": {
        "title": "Motiváció",
        "description": "Az informatikai területen töltött éveim során sok dokumentációt írtam arról, hogy miért választottam bizonyos technológiákat, könyvtárakat és megoldásokat. Tartottam néhány előadást is a csapataimban és  egyszerre több csapatnak is több témában. Ezek elkezdtek felhalmozódni, és rájöttem, hogy nincs semmi értékük a számítógépemen ülve, ezért úgy döntöttem, hogy a szabadidőmben újraírom őket egy olyan formátumba, amelyben nyilvánosságra hozhatom, ezzel segítve néhány embert, aki esetleg ugyanazt a kutakodást próbálja elvégezni, mint én."
      }
    },
    "about": {
      "colors": "Színek",
      "colorInspiration": "Az oldalon használt színek a következő témából inspirálódtak: ",
      "visuals": "Betűtípus- és Ikoncsomag",
      "technologiesUsed": "Felhasznált technológiák",
      "contact": "Elérhetőségek"
    },
    "cv": {
      "personal": {
        "title": "Személyes adatok",
        "locationTitle": "Lakhely",
        "location": "Kolozsvár, Románia",
        "birthTitle": "Születési dátum",
        "birth": "1998.03.08",
        "statusTitle": "Családi állapot",
        "status": "Egyedülálló",
        "officeTitle": "Preferált munkavégzés helye",
        "office": "Távmunkában vagy Kolozsváron, Románia"
      },
      "education": {
        "title": "Tanulmányok",
        "university": {
          "bachelor": {
            "degree": "Informatika Alapképzés",
            "institution": "Babeș-Bolyai Tudománygyetem",
            "year": "2017 - 2020",
            "thesisTitle": "Szakdolgozat címe: ",
            "thesis": "Cinemash - Hibrid filmajánló rendszer"
          },
          "master": {
            "degree": "Mesterképzés Enterprise Szoftverfejlesztésben",
            "institution": "Babeș-Bolyai Tudománygyetem",
            "year": "2020 - 2022",
            "thesis": "BrailleAssist - Egy alkalmazás látássérültek oktatásának segítésére"
          }
        }
      },
      "training": {
        "title": "Trainingek és Tanúsítványok",
        "trainings": {
          "azure": {
            "name": "Microsoft Azure Fundamentals - Training és Vizsga",
            "organizer": "Fundatia EOS Romania",
            "year": "2021",
            "link": "https://www.youracclaim.com/badges/17cf1240-d578-45b5-99c4-10e5d0761e2a"
          },
          "cleanCode": {
            "name": "Clean Code - Training",
            "organizer": "Bosch Romania",
            "year": "2023",
            "link": "https://www.victorrentea.ro/#training"
          },
          "unitTests": {
            "name": "Testing Best Practices - Training",
            "organizer": "Bosch Romania",
            "year": "2023",
            "link": "https://www.victorrentea.ro/#training"
          },
          "cleanArchitecture": {
            "name": "Clean Architecture - Training",
            "organizer": "Bosch Romania",
            "year": "2023",
            "link": "https://www.victorrentea.ro/#training"
          },
          "presentationSkills": {
            "name": "Prezentációs készségek - Training",
            "organizer": "Ascendis",
            "year": "2024",
            "link": "https://ascendis.ro/"
          },
          "timeManagement": {
            "name": "Time Management at Workplace and Working Environment - Training",
            "organizer": "Ascendis",
            "year": "2025",
            "link": "https://ascendis.ro/"
          }
        }
      },
      "work": {
        "title": "Tapasztalat",
        "experience": {
          "nokia": {
            "name": "Nokia Solutions and Networks KFT.",
            "position": "Automatizálási Gyakornok",
            "location": "Budapest, Magyarország",
            "period": "2019 június - 2019 szeptember",
            "description": "Telekommunikációs szolgáltatások automatizált telepítése OpenStack cloud infrastruktúrára, speciális grafikus felület készítése a telepítések egyszerűbb testreszabásához."
          },
          "boschWS": {
            "name": "Robert Bosch SRL",
            "position": "Gyakornok",
            "location": "Kolozsvár, Románia",
            "period": "2021. július – 2021. szeptember",
            "description": "Egy Java és Java Swing alapú asztali alkalmazáson dolgoztam. A funkciók, modulok, valamint azok bemenetei és kimenetei az ECU-n belüli mikrokontrollerek pinjeire való leképzés volt a feladata. A karbantartásért és az új funkciók fejlesztéséért voltam felelős."
          },
          "bosch": {
            "name": "Robert Bosch SRL",
            "position": "Szoftverfejlesztő",
            "location": "Kolozsvár, Románia",
            "period": "2022 július - jelenleg",
            "description": "Full-stack fejlesztőként dolgozom belső eszközökön és alkalmazásokon, amelyeket a vállalaton belül több száz mérnök használ, Java, Spring Boot, Angular, Github Actions és egyéb technológiák alkalmazásával."
          }
        }
      }
    }
  }
}
