{
  "app": {
    "heading": {
      "home": "Acasă",
      "about": "Despre",
      "cv": "CV"
    },
    "home": {
      "name": "Numele meu este ",
      "agePrefix": "am ",
      "ageSuffix": " de ani.",
      "profession": "Lucrez ca dezvoltator software de ",
      "specialty": " ani, specializat în dezvoltare web full-stack, cu accent pe logica de bază a aplicațiilor. Pe partea de backend de obicei lucrez cu Java și Spring Boot, în timp ce pe partea de frontend lucrez cu Angular.",
      "site": "Pe parcursul timpului petrecut pe internet am văzut o mulțime de designuri diferite de pagini web, site-uri statice etc., și m-a surprins mereu cât de supraîncărcate sunt, având designuri ciudate și fiind neoptimizate. Am avut un pic de timp liber și am decis să-mi creez un profil simplu, încercând să-l fac interactiv, păstrând în același timp un design simplu și un consum redus de resurse.",
      "opinions": "Un site ar trebui să aibă un contrast decent, text ușor de citit și un aspect curat și simplu. Animațiile ar trebui să aibă tranziții fluide. Dacă poate fi scris ca o aplicație simplă de tip single-page, ar trebui să fie scris astfel. Pachetul de fișiere statice nu ar trebui să depășească 1 MB și ar trebui să treacă toate testele cu un scor acceptabil."
    },
    "about": {
      "colors": "Culori",
      "colorInspiration": "Culorile folosite pe pagina de web sunt inspirate de ",
      "technologiesUsed": "Tehnologii folosite",
      "visuals": "Fontul și iconurile folosite",
      "contact": "Contact"
    },
    "posts": {
      "title": "Postări",
      "manifesto": {
        "title": "Manifest",
        "description": "În ultimii ani, content farming-ul în blogurile de tehnologie a crescut vizibil, ceea ce a dus la o calitate mai scăzută a informațiilor, având unele fragmente de cod care nici măcar nu funcționează, text care este clar scris de AI. Mai mult, o mare parte a conținutului este replicată din alte surse fără nicio atribuire. În acest blog garantez personal că postez lucruri pe care le-am încercat și implementat în prototipuri sau în producție la un moment dat, unde au funcționat pentru mine, sunt rezultatul propriei mele munci și cercetări, omițând detaliile care nu sunt în sfera subiectului sau sunt informații legate de proiect, făcându-l în același timp cât mai apropiat de un exemplu funcțional. Deși fac tot posibilul, nu pot garanta că pot actualiza și menține informațiile într-o stare funcțională. Dacă doriți să-mi susțineți munca, vă rog să distribuiți și să faceți referire la postarea pe care ați găsit-o utilă cu linkul către postarea mea și numele meu (Jakab Szilárd)."
      },
      "motivation": {
        "title": "Motivație",
        "description": "În anii mei în domeniul IT, am scris o mulțime de documentații argumentând de ce am ales anumite tehnologii, biblioteci și soluții. Am ținut și câteva prezentări în echipele mele și în mai multe echipe pe o serie de subiecte. Acestea au început să se adune și mi-am dat seama că nu au nicio valoare stând pe computerul meu, așa că am decis să le rescriu în timpul meu liber într-un format în care să le pot face publice, beneficiind astfel unele persoane care ar putea ajunge să încerce să facă aceeași cercetare ca și mine."
      }
    },
    "cv": {
      "personal": {
        "title": "Informații personale",
        "locationTitle": "Locație: ",
        "location": "Cluj-Napoca, România",
        "birthTitle": "Data nașterii: ",
        "birth": "1998.03.08",
        "statusTitle": "Stare civilă: ",
        "status": "Necăsătorit",
        "officeTitle": "Prefer să lucrez de la: ",
        "office": "Remote sau Cluj-Napoca, România"
      },
      "education": {
        "title": "Educație",
        "university": {
          "bachelor": {
            "degree": "Diplomă de licență în Informatică",
            "institution": "Universitatea Babeș-Bolyai",
            "year": "2017 - 2020",
            "thesisTitle": "Titlul lucrării: ",
            "thesis": "Cinemash - Sistem hibrid de recomandare a filmelor"
          },
          "master": {
            "degree": "Diplomă de master în Inginerie Software",
            "institution": "Universitatea Babeș-Bolyai",
            "year": "2020 - 2022",
            "thesis": "BrailleAssist - O aplicație pentru educația persoanelor cu deficiențe de vedere"
          }
        }
      },
      "training": {
        "title": "Traininguri & Certificări",
        "trainings": {
          "azure": {
            "name": "Microsoft Azure Fundamentals - Training și Examen",
            "organizer": "Fundația EOS România",
            "year": "2021",
            "link": "https://www.youracclaim.com/badges/17cf1240-d578-45b5-99c4-10e5d0761e2a"
          },
          "cleanCode": {
            "name": "Clean Code - Training",
            "organizer": "Bosch România",
            "year": "2023",
            "link": "https://www.victorrentea.ro/#training"
          },
          "unitTests": {
            "name": "Testing Best Practices - Training",
            "organizer": "Bosch România",
            "year": "2023",
            "link": "https://www.victorrentea.ro/#training"
          },
          "cleanArchitecture": {
            "name": "Clean Architecture - Training",
            "organizer": "Bosch România",
            "year": "2023",
            "link": "https://www.victorrentea.ro/#training"
          },
          "presentationSkills": {
            "name": "Abilități de prezentare - Training",
            "organizer": "Ascendis",
            "year": "2024",
            "link": "https://ascendis.ro/"
          },
          "timeManagement": {
            "name": "Managementul timpului la locul de muncă și mediul de lucru - Training",
            "organizer": "Ascendis",
            "year": "2025",
            "link": "https://ascendis.ro/"
          }
        }
      },
      "work": {
        "title": "Experiență profesională",
        "experience": {
          "nokia": {
            "name": "Nokia Solutions and Networks KFT.",
            "position": "Automation Trainee",
            "location": "Budapesta, Ungaria",
            "period": "Iunie 2019 - Septembrie 2019",
            "description": "Automatizarea deploymentului serviciilor de telecomunicații într-un cloud OpenStack, realizarea unei interfețe grafice specializate pentru personalizarea mai ușoară a instanțelor."
          },
          "boschWS": {
            "name": "Robert Bosch SRL",
            "position": "Working student",
            "location": "Cluj-Napoca, România",
            "period": "Iulie 2021 - Septembrie 2021",
            "description": "Am lucrat la o aplicație desktop scrisă în Java și Java Swing. Funcțiile, modulele, inputurile și outputurile acestora erau mapate pe pini ai microcontrolerelor dintr-un ECU. Am fost responsabil de mentenanță și dezvoltarea de noi funcționalități."
          },
          "bosch": {
            "name": "Robert Bosch SRL",
            "position": "Dezvoltator Software",
            "location": "Cluj-Napoca, România",
            "period": "Iulie 2022 - Prezent",
            "description": "Lucrez ca full-stack developer la instrumente și aplicații interne folosite în companie de sute de ingineri, folosind Java, Spring Boot, Angular, Github Actions și alte tehnologii conexe."
          }
        }
      }
    }
  }
}
